"===========================================================================
"General settings
"---------------------------------------------------------------------------

set nocp        "不兼容vi模式
set ru          "打开状态栏标尺显示行号、列号、百分比
set hls         "搜索时高亮显示被找到的文本
set nu          "显示行号

set backspace=indent,eol,start  
"可删除行首缩进、前行行末回车、输入字符之前字符

set matchpairs+=<:>     
"缺省为 "(:),{:},[:]"形成配对的字符。% 命令从其中一个跳转到另一个


"============================================================================
" Show
"----------------------------------------------------------------------------

set selectmode=

set keymodel=               
"不使用“Shift + 方向键”选择文本， “Shift + 方向键”代表向指定方向跳一个单词。 如果你喜欢这项功能的话， 可以使用“set keymodel=startsel,stopsel”打开它。

set mousemodel=popup
set selection=inclusive     "指定在选择文本时， 光标所在位置也属于被选中的范围

set splitbelow      " 如果打开，窗口的分割会把新窗口放到当前窗口之下
"set laststatus=2    "总是显示状态栏

"*for gdbvim
"set noshowcmd

"============================================================================
" Cut Line
"----------------------------------------------------------------------------

set tw=78                       "设置光标超过 78 列时候折行
set lbr                         "不在单词中间断行
set fo+=mB                      "断行支持东亚语言
set whichwrap=b,s,<,>,[,]       "按键开启到头后自动折向下一行

"============================================================================
" Tab & indent
"----------------------------------------------------------------------------

set sw=4            "自动缩进的时候， 缩进尺寸为 4 个空格
set ts=4            "Tab 宽度为 4 个字符
set et              "编辑时将所有 Tab 替换为空格，打开已有文件， 将已有 Tab 替换为空格用 :retab
set smarttab        "按一下 Backspace 删除 4 个空格



"============================================================================
" Code Edit
"----------------------------------------------------------------------------

set sm              "显示括号配对情况
syntax on           "打开关键字上色
set ai              "打开普通文件类型的自动缩进

"----------------------------------------------------------------------------
" C / C++
"----------------------------------------------------------------------------

set cin             "打开 C/C++ 风格的自动缩进
"打开了自动缩进后,粘贴乱版，输入“:set paste”关闭所有自动缩进。  粘贴完毕后再输入“:set nopaste”
set cino=:0g0t0(sus "设定 C/C++ 风格自动缩进的选项



"============================================================================
" Encoding
"----------------------------------------------------------------------------

set ambiwidth=double    "防止特殊符号无法显示


"============================================================================
" Fonts & Colors
"----------------------------------------------------------------------------
colo torte


"============================================================================
" Spell
"----------------------------------------------------------------------------
"set spell


"============================================================================
" GUI
"----------------------------------------------------------------------------



